In [15]:
import pandas as pd
import numpy as np

In [16]:
df=pd.read_csv("ds.csv")

In [17]:
df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [48]:
#find the null value in datasets
df.isnull().sum()

Unnamed: 0            0
work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [20]:
# Avarge the salaries in datasets
df["salary"].mean()

324000.0626029654

In [49]:
# the most salary
df["salary"].max()

30400000

In [55]:
# show Big data engineer in this datasets
df[df["job_title"] == 'Big Data Engineer']

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
17,17,2020,SE,FT,Big Data Engineer,100000,EUR,114047,PL,100,GB,S
31,31,2020,EN,FT,Big Data Engineer,70000,USD,70000,US,100,US,L
120,120,2021,MI,FT,Big Data Engineer,60000,USD,60000,ES,50,RO,M
180,180,2021,MI,FT,Big Data Engineer,1672000,INR,22611,IN,0,IN,L
192,192,2021,MI,FT,Big Data Engineer,18000,USD,18000,MD,0,MD,S
213,213,2021,EN,FT,Big Data Engineer,435000,INR,5882,IN,0,CH,L
230,230,2021,EN,FT,Big Data Engineer,1200000,INR,16228,IN,100,IN,L

In [57]:

df[df["job_title"] == 'Big Data Engineer']['salary'].max()

1672000

In [32]:
# the max salary in 2020
df.loc[df["salary"].idxmax()]

Unnamed: 0                       177
work_year                       2021
experience_level                  MI
employment_type                   FT
job_title             Data Scientist
salary                      30400000
salary_currency                  CLP
salary_in_usd                  40038
employee_residence                CL
remote_ratio                     100
company_location                  CL
company_size                       L
Name: 177, dtype: object

In [58]:
# the min salary in 2020
df.iloc[df["salary"].argmin()]

Unnamed: 0                      185
work_year                      2021
experience_level                 MI
employment_type                  FT
job_title             Data Engineer
salary                         4000
salary_currency                 USD
salary_in_usd                  4000
employee_residence               IR
remote_ratio                    100
company_location                 IR
company_size                      M
Name: 185, dtype: object

In [59]:
# the average salaries in three year
pd.DataFrame(df.groupby('work_year').mean()['salary'])

                  salary
work_year
2020       382386.236111
2021       546677.387097
2022       158827.786164

In [60]:
# the rate of jobs
df["job_title"].value_counts().head()

Data Scientist               143
Data Engineer                132
Data Analyst                  97
Machine Learning Engineer     41
Research Scientist            16
Name: job_title, dtype: int64

In [39]:
df[df['work_year']==2020]['job_title'].value_counts().head(5)

Data Scientist               21
Data Engineer                11
Data Analyst                  7
Machine Learning Engineer     5
Big Data Engineer             3
Name: job_title, dtype: int64

In [47]:
df[df['work_year']==2022]['experience_level'].value_counts().head(5)

SE    193
MI     91
EN     21
EX     13
Name: experience_level, dtype: int64